###################################################################

# Created by write_sdc on Tue Feb  9 16:00:44 2016

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_operating_conditions -max ss0p95v125c -max_library saed32rvt_ss0p95v125c\
                         -min ff1p16vn40c -min_library saed32rvt_ff1p16vn40c
set_max_area 0
create_clock [get_ports clk]  -period 333.3  -waveform {0 166.65}
set_clock_uncertainty 0.1  [get_clocks clk]
set_propagated_clock [get_clocks clk]
set_input_delay -clock clk  -max 0.6  [get_ports reset]
set_input_delay -clock clk  -min 0.3  [get_ports reset]
set_input_delay -clock clk  -max 0.6  [get_ports sprite]
set_input_delay -clock clk  -min 0.3  [get_ports sprite]
set_input_delay -clock clk  -max 0.6  [get_ports start]
set_input_delay -clock clk  -min 0.3  [get_ports start]
set_input_delay -clock clk  -max 0.6  [get_ports {type[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {type[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {type[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {type[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {X[5]}]
set_input_delay -clock clk  -min 0.3  [get_ports {X[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {X[4]}]
set_input_delay -clock clk  -min 0.3  [get_ports {X[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {X[3]}]
set_input_delay -clock clk  -min 0.3  [get_ports {X[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {X[2]}]
set_input_delay -clock clk  -min 0.3  [get_ports {X[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {X[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {X[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {X[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {X[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {Y[5]}]
set_input_delay -clock clk  -min 0.3  [get_ports {Y[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {Y[4]}]
set_input_delay -clock clk  -min 0.3  [get_ports {Y[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {Y[3]}]
set_input_delay -clock clk  -min 0.3  [get_ports {Y[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {Y[2]}]
set_input_delay -clock clk  -min 0.3  [get_ports {Y[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {Y[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {Y[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {Y[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {Y[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[12]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[12]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[11]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[11]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[10]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[10]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[9]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[9]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[8]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[8]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[7]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[6]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[5]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[4]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[3]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[2]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR0_Q[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR0_Q[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[12]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[12]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[11]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[11]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[10]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[10]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[9]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[9]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[8]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[8]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[7]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[6]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[5]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[4]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[3]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[2]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {SR1_Q[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {SR1_Q[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[11]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[11]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[10]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[10]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[9]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[9]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[8]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[8]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[7]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[6]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[5]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[4]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[3]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[2]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {FB_Q[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {FB_Q[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[11]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[11]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[10]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[10]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[9]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[9]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[8]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[8]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[7]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[6]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[5]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[4]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[3]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[2]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {bg_color[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {bg_color[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {game_mode[1]}]
set_input_delay -clock clk  -min 0.3  [get_ports {game_mode[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {game_mode[0]}]
set_input_delay -clock clk  -min 0.3  [get_ports {game_mode[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports ready]
set_output_delay -clock clk  -min 0.3  [get_ports ready]
set_output_delay -clock clk  -max 0.6  [get_ports done]
set_output_delay -clock clk  -min 0.3  [get_ports done]
set_output_delay -clock clk  -max 0.6  [get_ports SR0_CEN]
set_output_delay -clock clk  -min 0.3  [get_ports SR0_CEN]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[8]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[7]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[6]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[5]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[4]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[3]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[2]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[1]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR0_A[0]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR0_A[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports SR1_CEN]
set_output_delay -clock clk  -min 0.3  [get_ports SR1_CEN]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[8]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[7]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[6]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[5]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[4]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[3]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[2]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[1]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {SR1_A[0]}]
set_output_delay -clock clk  -min 0.3  [get_ports {SR1_A[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports FB_CEN]
set_output_delay -clock clk  -min 0.3  [get_ports FB_CEN]
set_output_delay -clock clk  -max 0.6  [get_ports FB_WEN]
set_output_delay -clock clk  -min 0.3  [get_ports FB_WEN]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[11]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[11]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[10]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[10]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[9]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[9]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[8]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[7]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[6]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[5]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[4]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[3]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[2]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[1]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_A[0]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_A[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[11]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[11]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[10]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[10]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[9]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[9]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[8]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[7]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[6]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[5]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[4]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[3]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[2]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[1]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {FB_D[0]}]
set_output_delay -clock clk  -min 0.3  [get_ports {FB_D[0]}]
